Revit 2026 API
AnalysisDisplayColorSettings Methods
The AnalysisDisplayColorSettings type exposes the following members.
Methods
Name | Description
AreIntermediateColorsValid
Colors |  Get number of colors, including min, max and intermediate.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetIntermediateColors |  Get intermediate color entries (other than the minimum and maximum settings).
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Compares two color settings objects.
SetIntermediateColors
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace